#@Schedules = new Meteor.Collection('schedules')

#groups: children, teens, lateteens, grownups

#if Meteor.isServer
#
#  if Schedules.find().count() is 0
#
#    Schedules.insert {
#
#      group: 'children'
#
#      schedule: {
#
#        10: {
#          1: ['стилистика', 'дефиле', 'красота и здоровье']
#          2: ['актерское мастерство', 'стилистика', 'дефиле']
#          4: ['верховая езда', 'актерское мастерство', 'стилистика']
#          5: ['верховая езда', 'актерское мастерство', 'стилистика']
#          6: ['дефиле', 'вечерние прогулки', 'красотища']
#          8: ['верховая езда', 'вечеринка', 'природоведение']
#          10: ['актерское мастерство', 'мейкап', 'физика']
#          11: ['верховая езда', 'психология', 'история']
#          12: ['красота и здоровье', 'психология', 'стилистика']
#          14: ['верховая езда', 'психология', 'история']
#          15: ['верховая езда', 'психология', 'история']
#          17: ['верховая езда', 'вечеринка', 'природоведение']
#          19: ['верховая езда', 'вечеринка', 'природоведение']
#          21: ['актерское мастерство', 'стилистика', 'дефиле']
#          22: ['стилистика', 'дефиле', 'красота и здоровье']
#          23: ['верховая езда', 'вечеринка', 'природоведение']
#          25: ['красота и здоровье', 'психология', 'стилистика']
#          27: ['актерское мастерство', 'стилистика', 'дефиле']
#          28: ['верховая езда', 'вечеринка', 'природоведение']
#          29: ['стилистика', 'дефиле', 'красота и здоровье']
#          30: ['стилистика', 'дефиле', 'красота и здоровье']
#        }
#
#      }
#
#    }
#
#    Schedules.insert {
#
#      group: 'teens_day'
#
#      schedule: {
#
#        10: {
#          2: ['стилистика', 'дефиле', 'красота и здоровье']
#          6: ['актерское мастерство', 'стилистика', 'дефиле']
#          8: ['верховая езда', 'актерское мастерство', 'стилистика']
#          5: ['верховая езда', 'актерское мастерство', 'стилистика']
#          6: ['дефиле', 'вечерние прогулки', 'красотища']
#          8: ['верховая езда', 'вечеринка', 'природоведение']
#          10: ['актерское мастерство', 'мейкап', 'физика']
#          12: ['верховая езда', 'психология', 'история']
#          13: ['красота и здоровье', 'психология', 'стилистика']
#          15: ['верховая езда', 'психология', 'история']
#          17: ['верховая езда', 'психология', 'история']
#          20: ['верховая езда', 'вечеринка', 'природоведение']
#          21: ['верховая езда', 'вечеринка', 'природоведение']
#          22: ['актерское мастерство', 'стилистика', 'дефиле']
#          25: ['стилистика', 'дефиле', 'красота и здоровье']
#        }
#
#      }
#
#    }