@Schedules = new Meteor.Collection('schedules')

#groups: children, teens, lateteens, grownups


Schedules.allow {

  insert: (userId)->
    if userId
      true

  update: (userId)->
    if userId
      true

}


#if Meteor.isServer
#
#  Schedules.find().fetch().forEach (s)->
#    Schedules.remove {'_id': s._id}
#
#
#
#
#  if Schedules.find().count() is 0
#
#    Schedules.insert {
#
#      group: 'lateTeens'
#
#      schedule: {
#
#        114: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            2: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            8: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            9: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            10: {
#              lessons: ['', 'этикет', 'стилистика']
#              color: '1'
#            }
#            11: {
#              lessons: ['этикет', 'имиджеология', 'имиджеология']
#              color: '2'
#            }
#            13: {
#              lessons: ['актерское мастерство', 'актерское мастерство', 'стилистика']
#              color: '1'
#            }
#            14: {
#              lessons: ['имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            15: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            16: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            17: {
#              lessons: ['', 'стилистика (выезд)', 'стилистика (выезд)']
#              color: '1'
#            }
#            18: {
#              lessons: ['этикет', 'имиджеология', 'имиджеология']
#              color: '1'
#            }
#            20: {
#              lessons: ['актерское мастерство', 'актерское мастерство', 'стилистика']
#              color: '1'
#            }
#            21: {
#              lessons: ['имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            22: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            23: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            24: {
#              lessons: ['', 'этикет', 'стилистика']
#              color: '1'
#            }
#            25: {
#              lessons: ['этикет', 'имиджеология', 'имиджеология']
#              color: '1'
#            }
#            27: {
#              lessons: ['актерское мастерство', 'актерское мастерство', 'стилистика']
#              color: '1'
#            }
#            29: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            30: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#    Schedules.insert {
#
#      group: 'children'
#
#      schedule: {
#
#        114: {
#          10: {
#            11: {
#              lessons: ['имиджеология', 'имиджеология', 'этикет']
#              color: '1'
#            }
#            12: {
#              lessons: ['английский', 'английский', 'этикет']
#              color: '1'
#            }
#            13: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство']
#              color: '1'
#            }
#            18: {
#              lessons: ['имиджеология', 'имиджеология', 'этикет']
#              color: '1'
#            }
#            19: {
#              lessons: ['английский', 'английский', 'этикет']
#              color: '1'
#            }
#            20: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство']
#              color: '1'
#            }
#            25: {
#              lessons: ['имиджеология', 'имиджеология', 'этикет']
#              color: '1'
#            }
#            26: {
#              lessons: ['английский', 'английский', 'этикет']
#              color: '1'
#            }
#            27: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#    Schedules.insert {
#
#      group: 'teens_day'
#
#      schedule: {
#
#        114: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            2: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            8: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            9: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            10: {
#              lessons: ['стилистика', 'стилистика', 'этикет']
#              color: '1'
#            }
#            12: {
#              lessons: ['этикет', 'этикет', 'имиджеология']
#              color: '1'
#            }
#            15: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            16: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            17: {
#              lessons: ['этикет', 'этикет', 'актерское мастерство']
#              color: '2'
#            }
#            19: {
#              lessons: ['стилистика', 'стилистика', 'имиджеология']
#              color: '1'
#            }
#            21: {
#              lessons: ['английский', 'имиджеология', '']
#              color: '1'
#            }
#            22: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            23: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            24: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство']
#              color: '1'
#            }
#            26: {
#              lessons: ['этикет', 'этикет', 'имиджеология']
#              color: '1'
#            }
#            28: {
#              lessons: ['английский', 'имиджеология', '']
#              color: '1'
#            }
#            29: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            30: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#  if Schedules.find({group: 'grownUps_evening'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'grownUps_evening'
#
#      schedule: {
#
#        114: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            2: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            8: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            9: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            10: {
#              lessons: ['стилистика', 'стилистика', 'этикет']
#              color: '1'
#            }
#            12: {
#              lessons: ['этикет', 'этикет', 'имиджеология']
#              color: '1'
#            }
#            15: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            16: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            17: {
#              lessons: ['этикет', 'этикет', 'актерское мастерство']
#              color: '1'
#            }
#            19: {
#              lessons: ['стилистика', 'стилистика', 'имиджеология']
#              color: '1'
#            }
#            21: {
#              lessons: ['английский', 'имиджеология', '']
#              color: '1'
#            }
#            22: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            23: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            24: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство']
#              color: '1'
#            }
#            26: {
#              lessons: ['этикет', 'этикет', 'имиджеология']
#              color: '1'
#            }
#            28: {
#              lessons: ['английский', 'имиджеология', '']
#              color: '1'
#            }
#            29: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#            30: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#
#  if Schedules.findOne({group: 'grownUps'})
#    Schedules.remove {'_id': Schedules.findOne({group: 'grownUps'})._id}
#
#    Schedules.insert {
#
#      group: 'grownUps'
#
#      schedule: {
#
#        114: {
#
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            2: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            8: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            9: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            10: {
#              lessons: ['стилистика', 'стилистика', 'этикет', 'английский', 'английский']
#              color: '1'
#            }
#            12: {
#              lessons: ['этикет', 'этикет', 'имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            15: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            16: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            17: {
#              lessons: ['этикет', 'этикет', 'актерское мастерство', 'английский', 'английский']
#              color: '1'
#            }
#            19: {
#              lessons: ['стилистика', 'стилистика', 'имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            21: {
#              lessons: ['английский', 'имиджеология', '', 'английский', 'английский']
#              color: '1'
#            }
#            22: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            23: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            24: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство', 'английский', 'английский']
#              color: '1'
#            }
#            26: {
#              lessons: ['этикет', 'этикет', 'имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            28: {
#              lessons: ['английский', 'имиджеология', '', 'английский', 'английский']
#              color: '1'
#            }
#            29: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            30: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#          }
#
#        }
#
#      }
#
#    }
#  if Schedules.find({group: 'summerSchool_evening'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'summerSchool_evening'
#
#      schedule: {
#
#        115: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#  if Schedules.find({group: 'onlineSchool'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'onlineSchool'
#
#      schedule: {
#
#        115: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#  if Schedules.find({group: 'summerSchool'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'summerSchool'
#
#      schedule: {
#
#        115: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#
#  if Schedules.findOne({group: 'grownUps'})
#    Schedules.remove {'_id': Schedules.findOne({group: 'grownUps'})._id}
#
#    Schedules.insert {
#
#      group: 'grownUps'
#
#      schedule: {
#
#        114: {
#
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            2: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            8: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            9: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            10: {
#              lessons: ['стилистика', 'стилистика', 'этикет', 'английский', 'английский']
#              color: '1'
#            }
#            12: {
#              lessons: ['этикет', 'этикет', 'имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            15: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            16: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            17: {
#              lessons: ['этикет', 'этикет', 'актерское мастерство', 'английский', 'английский']
#              color: '1'
#            }
#            19: {
#              lessons: ['стилистика', 'стилистика', 'имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            21: {
#              lessons: ['английский', 'имиджеология', '', 'английский', 'английский']
#              color: '1'
#            }
#            22: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            23: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            24: {
#              lessons: ['стилистика', 'стилистика', 'актерское мастерство', 'английский', 'английский']
#              color: '1'
#            }
#            26: {
#              lessons: ['этикет', 'этикет', 'имиджеология', 'английский', 'английский']
#              color: '1'
#            }
#            28: {
#              lessons: ['английский', 'имиджеология', '', 'английский', 'английский']
#              color: '1'
#            }
#            29: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#            30: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда', 'английский', 'английский']
#              color: '1'
#            }
#          }
#
#        }
#
#      }
#
#    }

#if Meteor.isServer
#
#  if Schedules.find({group: 'onlineSchool_morning'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'onlineSchool_morning'
#
#      times: ['12:00 - 13:00']
#
#      schedule: {
#
#        116: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#  if Schedules.find({group: 'onlineSchool_weekend'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'onlineSchool_weekend'
#
#      times: ['13:00 - 14:00', '18:00 - 19:00']
#
#      schedule: {
#
#        116: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#  if Schedules.find({group: 'onlineSchool_evening'}).count() is 0
#
#    Schedules.insert {
#
#      group: 'onlineSchool_evening'
#
#      times: ['18:30 - 19:30']
#
#      schedule: {
#
#        116: {
#          10: {
#            1: {
#              lessons: ['верховая езда', 'верховая езда', 'верховая езда']
#              color: '1'
#            }
#          }
#        }
#
#      }
#
#    }
#
#  Schedules.find().forEach (schedule)=>
#    if schedule.group is 'lateTeens' or schedule.group is 'children' or schedule.group is 'teens_day' or schedule.group is 'summerSchool'
#      Schedules.update schedule._id,  {$set: {times: ['17:00 - 17:45', '17:55 - 18:40', '18:45 - 19:30']}}
#    else if schedule.group is 'grownUps_evening' or schedule.group is 'summerSchool_evening'
#      Schedules.update schedule._id,  {$set: {times: ['19:30 - 20:15', '20:25 - 21:10', '21:15 - 22:00']}}
#    else if schedule.group is 'grownUps'
#      Schedules.update schedule._id,  {$set: {times: ['11:00 - 11:45', '11:55 - 12:35', '12:45 - 13:30', '13:40 - 14:25', '14:35 - 15:10']}}
#    else if schedule.group is 'onlineSchool_evening'
#      Schedules.update schedule._id,  {$set: {times: ['18:30 - 19:30']}}
#    else if schedule.group is 'onlineSchool_morning'
#      Schedules.update schedule._id,  {$set: {times: ['12:00 - 13:00']}}
#    else if schedule.group is 'onlineSchool_weekend'
#      Schedules.update schedule._id,  {$set: {times: ['13:00 - 14:00', '18:00 - 19:00']}}

unless Schedules.findOne({ group: 'threeDays' })
  Schedules.insert
    group: 'threeDays'
    schedule: {}
